Autodesk.Revit.DB.GridTypeSet
A set that contains grid types.

Autodesk.Revit.DB.GridTypeSet.Insert(Autodesk.Revit.DB.GridType)
System.Int32
Insert the specified grid type into the set.
item: The grid type to be inserted into the set.
Returns: Returns whether the grid type was inserted into the set.

Autodesk.Revit.DB.GridTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.GridTypeSet.ReverseIterator
Autodesk.Revit.DB.GridTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.GridTypeSet.ForwardIterator
Autodesk.Revit.DB.GridTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.GridTypeSet.Erase(Autodesk.Revit.DB.GridType)
System.Int32
Removes a specified grid type from the set.
item: The grid type to be erased.
Returns: The number of grid types that were erased from the set.

Autodesk.Revit.DB.GridTypeSet.Contains(Autodesk.Revit.DB.GridType)
System.Boolean
Tests for the existence of a grid type within the set.
item: The grid type to be searched for.
Returns: The Contains method returns True if the grid type is within the set, otherwise False.

Autodesk.Revit.DB.GridTypeSet.Clear
void
Removes every grid type from the set, rendering it empty.

Autodesk.Revit.DB.GridTypeSet.Size
System.Int32
get
Returns the number of grid types that are in the set.

Autodesk.Revit.DB.GridTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.